
---

> **ВАЖНО**
> 
> Форма для ответов на вопросы будет доступна только при развертывании лабораторной работы 

---

## Топология

![](./assets/topology.png)

## Задачи

Часть 1. Проверить конфигурацию коммутатора по умолчанию

Часть 2. Настроить основные параметры коммутатора

Часть 3. Настроить баннер MOTD (сообщения дня)

Часть 4. Сохранить файлы конфигурации в NVRAM

Часть 5. Настроить коммутатор S2

## Общие сведения и сценарий

В этом упражнении вы настроите базовые параметры коммутатора. Затем вам будет необходимо обеспечить безопасность доступа к интерфейсу командной строки (CLI) и портам консоли с помощью зашифрованных и текстовых паролей. Вы также научитесь настраивать сообщения для пользователей, выполняющих вход в систему коммутатора. Эти баннеры также предупреждают пользователей о том, что несанкционированный доступ запрещен.

**Примечание.** В Packet Tracer, коммутатор Catalyst 2960 использует IOS версии 12.2 по умолчанию. При необходимости версию IOS можно обновить с файлового сервера в топологии Packet Tracer. После этого коммутатор может быть настроен на загрузку до версии IOS 15.0, если она требуется.

## Инструкции

### Часть 1. Проверка конфигурации коммутатора по умолчанию

**Шаг 1. Войдите в привилегированный режим EXEC**

Привилегированный режим EXEC дает доступ ко всем командам коммутатора. Но поскольку многие привилегированные команды задают рабочие параметры, привилегированный доступ должен быть защищен паролем, чтобы предотвратить несанкционированное использование.

Набор привилегированных команд EXEC включает в себя команды, доступные в пользовательском режиме EXEC, множество дополнительных и команду **configure**, с помощью которой обеспечивается доступ к режимам конфигурации.

1.  Щелкните **S1** и откройте вкладку CLI. Нажмите клавишу ввода.

2.  Перейдите в привилегированный режим EXEC, выполнив команду **enable**.

    ```
    Switch> enable
    Switch#
    ```

    Обратите внимание, что командная строка изменилась, указывая на привилегированный режим EXEC.

**Шаг 2. Изучите текущую конфигурацию коммутатора**

Введите команду **show running-config**.

```
Switch# show running-config
```

Ответьте на следующие вопросы:

- вопрос №1;

- вопрос №2;

- вопрос №3;

- вопрос №4;

- вопрос №5.

### Часть 2. Настройка основных параметров коммутатора

**Шаг 1. Присвойте коммутатору имя**

Для настройки параметров коммутатора, возможно, потребуется переключаться между режимами настройки. Обратите внимание, как изменяется командная строка при переходе по разделам меню коммутатора.

```
Switch# configure terminal
Switch(config)# hostname S1
S1(config)# exit
S1#
```

**Шаг 2. Обеспечьте безопасный доступ к консоли**

Для безопасного доступа к консоли перейдите в режим **config-line** и установите для консоли пароль **letmein**.

```
S1# configure terminal
Введите построчно команды настройки. В конце нажмите CNTL/Z.
S1(config)# line console 0
S1(config-line)# password letmein
S1(config-line)# login
S1(config-line)# exit
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1#
```

- Ответьте на вопрос №6

**Шаг 3. Убедитесь, что доступ к консоли защищен**

Выйдите из привилегированного режима, чтобы убедиться, что для консольного порта установлен пароль.

```
S1# exit
Switch con0 is now available
Press RETURN to get started.
User Access Verification
Password:
S1>
```

**Примечание.** Если коммутатор не выводит запрос на ввод пароля, значит, вы не настроили параметр **login** в шаге 2.

**Шаг 4. Обеспечьте безопасный доступ к привилегированному режиму**

Установите для **enable** пароль **c1$c0**. Он ограничивает доступ к привилегированному режиму.

**Примечание.** Символ **0** в **c1$c0** — это ноль, а не заглавная буква «O». Этот пароль будет считаться неверным, пока вы не зашифруете его в шаге 8.

```
S1> enable
S1# configure terminal
S1(config)# enable password c1$c0
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1#
```

**Шаг 5. Убедитесь, что доступ к привилегированному режиму защищен**

1.  Выполните команду **exit** еще раз, чтобы выйти из коммутатора.

2.  Нажмите клавишу ввода, после чего вам будет предложено ввести пароль.

    ```
    User Access Verification
    Password:
    ```

3.  Первый пароль — это пароль для консоли, который был задан для **line con 0**. Введите его, чтобы вернуться в пользовательский режим EXEC.

4.  Введите команду для доступа к привилегированному режиму.

5.  Введите второй пароль, который был задан для ограничения доступа к привилегированному режиму EXEC.

6.  Проверьте конфигурацию, изучив содержимое файла **running-configuration**:

    ```
    S1# show running-config
    ```

    Обратите внимание, что пароли для консоли и привилегированного режима отображаются в виде обычного текста. Это может представлять угрозу безопасности, если кто-то смотрит через ваше плечо или получает доступ к конфигурационным файлам, хранящимся в резервной копии.

**Шаг 6. Настройте зашифрованный пароль для доступа к привилегированному режиму**

Пароль для **enable** нужно заменить на новый зашифрованный пароль с помощью команды **enable secret**. Установите пароль **itsasecret**.

```
S1# config t
S1(config)# enable secret itsasecret
S1(config)# exit
S1#
```

**Примечание.** Пароль **enable secret** перезаписывает пароль **enable**. Если для коммутатора заданы оба пароля, для перехода в привилегированный режим EXEC нужно ввести пароль **enable secret**.

**Шаг 7. Убедитесь в том, что пароль enable secret добавлен в файл конфигурации**

Введите команду **show running-config** еще раз, чтобы проверить новый пароль enable secret.

Примечание. Команду **show running-config** можно сократить до:

```
S1# show run
```

- Ответьте на вопрос №7

- Ответьте на вопрос №8

**Шаг 8. Зашифруйте пароли enable и console**

Как было видно в шаге 7, пароль **enable secret** зашифрован, а пароли **enable** и **console** хранятся в виде обычного текста. Сейчас мы зашифруем эти открытые пароли с помощью команды **service password-encryption**.

```
S1# config t
S1(config)# service password-encryption
S1(config)# exit
```

- Ответьте на вопрос №9

### Часть 3. Настройка баннера MOTD

**Шаг 1. Настройте баннер MOTD (сообщения дня)**

В набор команд Cisco IOS входит команда, позволяющая настроить сообщение, которое будут видеть все, кто входит в систему на коммутаторе. Это сообщение называется сообщением дня или баннером MOTD (message of the day). Текст баннера нужно заключить в двойные кавычки или использовать разделитель, отличный от любого символа в строке MOTD.

```
S1# config t
S1(config)# banner motd "This is a secure system. Authorized Access Only!"
S1(config)# exit
%SYS-5-CONFIG_I: Configured from console by console
S1#
```

- Ответьте на вопрос №10

- Ответьте на вопрос №11

### Часть 4. Сохраните и проверьте файлы конфигурации на NVRAM

**Шаг 1. Проверьте правильность конфигурации с помощью команды show run**

Сохраните файл конфигурации. Вы завершили основную настройку коммутатора. Теперь выполните резервное копирование файла конфигурации в **NVRAM** и убедитесь, что внесенные изменения не были потеряны при перезагрузке системы или отключении питания.

```
S1# copy running-config startup-config
Destination filename [startup-config]?[Enter]
Building configuration...
[OK]
```

- Ответьте на вопрос №12

Изучите файл загрузочной конфигурации.

- Ответьте на вопрос №13

### Часть 5. Настройка коммутатора S2

Вы завершили настройку коммутатора **S1**. Теперь настройте коммутатор **S2**. Если вы не можете вспомнить команды, вернитесь к частям 1–4.

Настройте для коммутатора **S2** следующие параметры.

1.  Имя устройства: **S2**

2.  Защитите доступ к консоли паролем **letmein**.

3.  Установите в качестве пароля enable **c1$c0**, а в качестве пароля enable secret — **itsasecret**.

4.  Настройте соответствующее сообщение для тех, кто вошел в коммутатор.

5.  Зашифруйте все открытые пароли.

6.  Проверьте правильность конфигурации.

7.  Сохраните файл конфигурации, чтобы он не пропал, если отключитмя питание коммутатора.

<!-- [Скачать файл Packet Tracer для локального запуска](./assets/2.5.5-lab.pka) -->
